microresearch/allcolours/SR_segments/software/stm32f4xx_it_theone.c
uint16_t divy[12]={1364, 1364, 1364, 1023, 818, 681, 584, 511, 454, 408, 371, 340};

uint8_t logtable[4]={0,0,0,0};

// array of spacers for DAC code
static uint32_t shifty_spacers[8]={1,2,3,4,5,6,7,8};

// fix this array as seems off...//FIXED 5/10 using code in test.c based on gaps
static uint32_t pos[32][8]={ // for DAC PWM out wider spacings
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,0,0,0,0,0,0,0},
{0,1,1,1,1,1,1,1},
{0,1,2,2,2,2,2,2},
{0,1,1,2,2,3,3,3},
{0,1,2,3,3,4,4,4},
{0,1,2,3,3,4,4,4},
{0,1,2,3,3,4,4,4},
{0,1,2,3,4,5,5,5},
{0,1,2,3,4,5,6,6},
{0,1,2,3,4,5,6,7},
{0,1,3,4,5,6,7,8},
{0,1,3,5,6,7,8,9},
{0,1,3,5,6,8,9,10},
{0,1,3,5,6,8,10,11},
{0,1,3,6,7,9,11,12},
{0,1,3,6,7,9,12,13},
{0,2,4,7,8,10,13,14},
{0,2,4,7,8,10,13,15},
{0,2,4,7,9,11,14,16},
{0,2,5,8,10,12,15,17},
{0,2,5,8,10,13,16,18},
{0,3,6,9,11,14,17,19},
{0,3,6,9,12,15,18,20},
{0,3,6,9,12,15,18,21},
{0,4,7,10,13,16,19,22}
};

 uint32_t spac[32]={0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2, 3, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5, 6, 6, 6, 6, 7, 7, 7, 7};

 uint32_t spacc[32][3]={
{0, 0, 0 },
{0, 0, 0 },
{0, 0, 0 },
{0, 0, 0 },
{1, 2, 3 },
{1, 2, 3 },
{1, 2, 3 },
{1, 2, 3 },
{2, 4, 6 },
{2, 4, 6 },
{2, 4, 6 },
{2, 4, 6 },
{3, 6, 9 },
{3, 6, 9 },
{3, 6, 9 },
{3, 6, 9 },
{4, 8, 12 },
{4, 8, 12 },
{4, 8, 12 },
{4, 8, 12 },
{5, 10, 15 },
{5, 10, 15 },
{5, 10, 15 },
{5, 10, 15 },
{6, 12, 18 },
{6, 12, 18 },
{6, 12, 18 },
{6, 12, 18 },
{7, 14, 21 },
{7, 14, 21 },
{7, 14, 21 },
{7, 14, 21 }
  };


uint32_t spacmask[32]={
0b11111111111111111111111111111011,
0b11111111111111111111111111111011,
0b11111111111111111111111111111011,
0b11111111111111111111111111111011,
0b11111111111111111111111111110000,
0b11111111111111111111111111110000,
0b11111111111111111111111111110000,
0b11111111111111111111111111110000,
0b11111111111111111111111110101010,
0b11111111111111111111111110101010,
0b11111111111111111111111110101010,
0b11111111111111111111111110101010,
0b11111111111111111111110110110110,
0b11111111111111111111110110110110,
0b11111111111111111111110110110110,
0b11111111111111111111110110110110,
0b11111111111111111110111011101110,
0b11111111111111111110111011101110,
0b11111111111111111110111011101110,
0b11111111111111111110111011101110,
0b11111111111111110111101111011110,
0b11111111111111110111101111011110,
0b11111111111111110111101111011110,
0b11111111111111110111101111011110,
0b11111111111110111110111110111110,
0b11111111111110111110111110111110,
0b11111111111110111110111110111110,
0b11111111111110111110111110111110,
0b11111111110111111011111101111110,
0b11111111110111111011111101111110,
0b11111111110111111011111101111110,
0b11111111110111111011111101111110
};

uint32_t lastspac[32][4]={
{0, 1, 2, 3 },
{0, 1, 2, 3 },
{0, 1, 2, 3 },
{0, 1, 2, 3 },
{0, 1, 2, 3 },
{0, 1, 2, 3 },
{0, 1, 2, 3 },
{0, 1, 2, 3 },
{1, 3, 5, 7 },
{1, 3, 5, 7 },
{1, 3, 5, 7 },
{1, 3, 5, 7 },
{2, 5, 8, 11 },
{2, 5, 8, 11 },
{2, 5, 8, 11 },
{2, 5, 8, 11 },
{3, 7, 11, 15 },
{3, 7, 11, 15 },
{3, 7, 11, 15 },
{3, 7, 11, 15 },
{4, 9, 14, 19 },
{4, 9, 14, 19 },
{4, 9, 14, 19 },
{4, 9, 14, 19 },
{5, 11, 17, 23 },
{5, 11, 17, 23 },
{5, 11, 17, 23 },
{5, 11, 17, 23 },
{6, 13, 20, 27 },
{6, 13, 20, 27 },
{6, 13, 20, 27 },
{6, 13, 20, 27 }
};

uint32_t lastspacbac[32][4]={
{0, 0, 0, 0 },
{0, 0, 0, 0 },
{0, 0, 0, 0 },
{0, 0, 0, 0 },
{0, 0, 0, 0 },
{0, 0, 0, 0 },
{0, 0, 0, 0 },
{0, 0, 0, 0 },
{1, 2, 2, 4 },
{1, 2, 2, 4 },
{1, 2, 2, 4 },
{1, 2, 2, 4 },

{2, 4, 6, 8 },
{2, 4, 6, 8 },
{2, 4, 6, 8 },
{2, 4, 6, 8 },

{3, 6, 8, 12 },
{3, 6, 8, 12 },
{3, 6, 8, 12 },
{3, 6, 8, 12 },

{4, 8, 12, 16 },
{4, 8, 12, 16 },
{4, 8, 12, 16 },
{4, 8, 12, 16 },

{5, 10, 15, 20 },
{5, 10, 15, 20 },
{5, 10, 15, 20 },
{5, 10, 15, 20 },

{6, 12, 18, 24 },
{6, 12, 18, 24 },
{6, 12, 18, 24 },
{6, 12, 18, 24 }

};

uint32_t others[4][3]={ // for triadex style - all but itself
{1,2,3},
{0,2,3},
{0,1,3},
{0,1,2}
};

// 0: xbits in, 1: 1bit 2: LFSR 3: equivalent bits 4: oscillator/clock 5: DACfrom_reg 6:param_from_reg 7:param as comparator for a single bit
// 8: seperate LFSR running here with length/length
static inline int ADC_(uint32_t reg, uint32_t length, uint32_t type, uint32_t otherpar){ // here we use length as number of bits max is 12 bits
  static uint32_t n[4]={0,0,0,0},nn[4]={0,0,0,0}; // counters
  static int32_t integrator=0, oldValue=0;
  static uint32_t k, lastbt=0; // 21/9 - we didn't have k for one bits as static - FIXED/TEST!
  static uint8_t toggle=0;
  uint32_t bt=0;

  switch(type){
  case 0: // basic sequential length of upto 12 bits cycling in
  if (length>11) length=11;
      if (n[reg]>length) {
	k=(adc_buffer[12])>>(11-length); //
      n[reg]=0;
    }
    bt = (k>>n[reg])&0x01;
    n[reg]++;    
    break;

  case 1: // one bit audio input
    n[reg]++;
  if (n[reg]>50) {
    k=(adc_buffer[12]); // now 12 bits only // 16 bits to 12 bits - this is now our ADCin!
    n[reg]=0;
  }

  integrator+=k-oldValue;
   if(integrator>0)
  {
     oldValue=MAXVALUE;
     bt=1;
  }
   else
   {
      oldValue=0;
      bt=0;
   }   
   break;
  case 2: // LFSR
     // if we never change that default we can replace LFSR[reg] with reg!
    bt = ((shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][0])) ^ (shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][1])) ^ (shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][2])) ^ (shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][3]))) & 1u;
    break;
  case 3: // equivalent bits: TO TEST
       // lengths upto 11=12 - we need tables for divisions/shifts 
  if (length>11) length=11;

  if (n[reg]>length) {
    k=(adc_buffer[12]); //
    k=k/divy[length];
    n[reg]=0;
  }
  if (k!=0) {
    bt=1;
    k--;
  }
  else bt=0;
  n[reg]++;    
  break;
  case 4:// // 1 bit oscillator - train of length 1 bits followed by y 0 bits // here we need 2 params... we use otherpar
     if (n[reg]>length) { // 0s
       bt=0;
       if (nn[reg]>otherpar) {
	 n[reg]=0;
       }
       nn[reg]++;
     }
     else {
       bt=1;
       n[reg]++;
       nn[reg]=0;
     }         
     break;    
  case 5: // dac[otherpar] seq input we use otherpar
  if (length>11) length=11;
      if (n[reg]>length) {
	k=(dac[otherpar])>>(11-length); 
      n[reg]=0;
    }
    bt = (k>>n[reg])&0x01;
    n[reg]++;    
    break;
  case 6: //param[reg] seq input
  if (length>11) length=11;
      if (n[reg]>length) {
	k=(param[reg])>>(11-length); 
      n[reg]=0;
    }
    bt = (k>>n[reg])&0x01;
    n[reg]++;    
    break;

  case 7:// run LFSR-ADCshift and output a bit - again if we don't use redirection of LFSR[reg] then ...
    bt = ((ADCshift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][0])) ^ (ADCshift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][1])) ^ (ADCshift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][2])) ^ (ADCshift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][3]))) & 1u;
    ADCshift_[LFSR[reg]]=(ADCshift_[LFSR[reg]]<<1)+bt;
    break;
    
  case 8:     // we accumulate bits onto a ghosted register TO TEST
    // STROBE places these onto the shift register in one chunk?
    // so we don't use returned bt
      if (length>11) length=11;
      if (n[reg]>length) {
	k=(adc_buffer[12])>>(11-length); //
      n[reg]=0;
    }
    bt = (k>>n[reg])&0x01;
    n[reg]++;    
    // then bt goes into newghostSR
    ADCGshift_[reg]=(ADCGshift_[reg]<<1)+bt;

    if (otherpar) { // strobe
      shift_[reg]&=invmasky[length]; // clear length bits
      shift_[reg]+=(ADCGshift_[reg]&masky[length]);
    }
    break;

  case 9: // basic sequential length of bits cycling in but zeroed by param which is trigger
  if (length>11) length=11;
      if (n[reg]>length) {
	k=(adc_buffer[12])>>(11-length); //
      n[reg]=0;
    } 
     if (otherpar) bt=0;
      else bt = (k>>n[reg])&0x01;
    n[reg]++;    
    break;
    
  case 10: // one bit audio input
    n[reg]++;
  if (n[reg]>50) {
    k=dac[otherpar];
    n[reg]=0;
  }

  integrator+=k-oldValue;
   if(integrator>0)
  {
     oldValue=MAXVALUE;
     bt=1;
  }
   else
   {
      oldValue=0;
      bt=0;
   }   
   break;

