microresearch/allcolours/SR_segments/software/stm32f4xx_it_theone.c
  case 11:  // special case for spaced bit entry depending on length
    shift_[reg]&=spacmask[length]; //cleared
    k=(adc_buffer[12])>>8; // we want 4 bits
    shift_[reg]+=(k&1)+((k&2)<<spacc[length][0])+((k&4)<<spacc[length][1])+((k&8)<<spacc[length][2]);
    // 4 bits goes in
    // no bt return
    bt=0;
    break;   

    // strobe // latch modes - strobe becomes toggle
  case 12:     // 1-we keep on cycling ADC bits but only enter new bit on strobe - or vice versa
    if (otherpar) toggle^=1;

    if (length>11) length=11;
      if (n[reg]>length) {
	k=(adc_buffer[12])>>(11-length); //
      n[reg]=0;
    }
      if (toggle) {// strobe
      bt = (k>>n[reg])&0x01;
      lastbt=bt;
      }
      else bt=lastbt;
    n[reg]++;    
    break;
    
  case 13:     // 2-we only cycle ADC on strobe/toggle  - or vice versa
    if (otherpar) toggle^=1;
    if (length>11) length=11;

  if (n[reg]>length) {
	k=(adc_buffer[12])>>(11-length); //
      n[reg]=0;
    }
      bt = (k>>n[reg])&0x01;

      if (toggle) {// strobe
    n[reg]++;    
      }
    break;

  case 14: // STROBE: 3-one bit entry
    if (otherpar) toggle^=1;
    n[reg]++;
  if (n[reg]>50) {
    k=(adc_buffer[12]); // now 12 bits only // 16 bits to 12 bits - this is now our ADCin!
    n[reg]=0;
  }

  integrator+=k-oldValue;
   if(integrator>0)
  {
     oldValue=MAXVALUE;
     bt=1;
  }
   else
   {
      oldValue=0;
      bt=0;
   }   

      if (toggle) {// strobe
	lastbt=bt;
      }
      else bt=lastbt;
   break;

     case 15:// STROBE: run LFSR-ADCshift and output a bit - again if we don't use redirection of LFSR[reg] then ..
       if (otherpar) toggle^=1;
    bt = ((ADCshift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][0])) ^ (ADCshift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][1])) ^ (ADCshift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][2])) ^ (ADCshift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][3]))) & 1u;
    ADCshift_[LFSR[reg]]=(ADCshift_[LFSR[reg]]<<1)+bt;
      if (toggle) {// strobe
	lastbt=bt;
      }
      else bt=lastbt;    
    break;

  case 16: // STROBE for other LFSR too
     // if we never change that default we can replace LFSR[reg] with reg!
    if (otherpar) toggle^=1;
    bt = ((shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][0])) ^ (shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][1])) ^ (shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][2])) ^ (shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][3]))) & 1u;
      if (toggle) {// strobe
	lastbt=bt;
      }
      else bt=lastbt;    
    break;
       
    // INT MODES ONLY FROM HERE ON!
  case 21: // INT // CV as comparator - for INT modes ONLY which don't use CV!
     bt=0;
     if (adc_buffer[12]>adc_buffer[lookupadc[reg]]) bt=1;
     break;
  case 22: // INT  //param[reg] as comparator
     bt=0;
     if ((adc_buffer[12]>>2)>param[reg]) bt=1;
     break;
     
  } // switch
     
  return bt;
}


static inline uint16_t leaks(uint16_t x, uint16_t y, uint16_t prob, uint16_t who){ // try lazy, stickyt, leaky, decaying logic here... // who is new 20/9 for which SR we take logic from...
  static uint16_t timer=0;
  uint16_t z;
  // p as probability or time
  // keep track of how many times this is called (for each register/bit position) and flipit

  // or we can track bits recording their position for a certain lifespan
  // one bit per SR is tracked and lost... so would be leakNSR for example for that bit
  
  // but that is too deterministic... but if we share timers or if timer is across different speeds
  //  prob=1;
  // leaky XOR to test
  if (prob>31) prob=31;
  
  if (x^y==0) return 0;
  //  shift_registerR=(shift_registerR<<1)+z; // we are shifting left << so bit 31 is out last one
  if ((shift_[who]&masky[prob])==0) return 1;
  //  else if (rand()%prob==0) return 1;
  return 0;
  
  /*  timer++;
  if (timer>p){
    timer=0;
    d^=1;
    }*/
}


//bitr=logop(bitr,bitrr,logopp[w]); // or other op TODO
// logop: 0-XOR, 1-OR, 2-&, 3leaks
static inline uint16_t logop(uint32_t bita, uint32_t bitaa, uint32_t type){ //TODO: xor, or, and, leaky, others?
  // 0 is XOR< 1 is OR etc
  if (type==0)  return (bita ^ bitaa);
  else if (type==1) return (bita | bitaa);
  else if (type==2) return (bita & bitaa);
  else if (type==3) return (leaks(bita, bitaa,8,3)); // leaks using RSR as random // where we get 8 from...
  return bita ^ bitaa; // default
}

// 0: xbit DAC, 1: equiv DAC, 2: 1bit 3: spacers 4: strobed xbit DAC UNTESTED 5: 4 bits spaced dac/no equv 6: 
// TODO: what we add to this: shifty_spacers, sequential x bit DAC, sequential equiv DAC, seq spaced DAC
// also we can have one bit data with selection of params for BETA!

static inline uint32_t DAC_(uint32_t reg, uint32_t length, uint32_t type, uint32_t param){ //
  // DAC is 12 bits
  uint32_t y,x=0;
  static float SmoothData[4]={0.0, 0.0, 0.0, 0.0};
  static uint32_t lastout=0;
  static uint8_t toggle=0;
  
  switch(type){
  case 0:// standard bit DAC for x bits
    //    if (reg<4 && length>3 && length<32) 
      x=((shift_[reg] & masky[length-3])>>(rightshift[length-3]))<<leftshift[length-3]; // we want 12 bits but is not really audible difference    
      break;
  case 1:
      // equivalent bit DAC for x bits - we need a table for this!
      // or more like set of tables for each bit
      // and we need divide highest but number - eg. for 8 bits we have max 8 (all 1s) - max 12 bits DAC is 4096 4096/8=512 4096/12=341
      // we can have another table for this - but just taking maybe max of 12 bits otherwise lookup is too long (max 12 bits=4096)
    //      if (reg<4){
    //    length=8;
	if (length>11) length=11;
	x=countbts[shift_[reg]&masky[length]]; // lower length bits only
	y=divy[length]; // added table for this 7/10
	  x*=y;
	  //      }
	  break;
  case 2: // one bit audio
    // top bit
    y=(shift_[reg]>>length)&1;
    if (y==1) x=4095;
    else x=0;
    SmoothData[reg] = SmoothData[reg] - (LPF_Beta * (SmoothData[reg] - x)); // how do we adjust beta for speed?
    x=(int)SmoothData[reg];
    break;
  case 3: //spacers - how did we do this?
    x = (shift_[reg]&0xFF)<<4; // just the lower 8 bits - no spacings
    if (length>7){ // real length >8
      x = ((shift_[reg] & 0x01) + ((shift_[reg]>>pos[length][1])&0x02) + ((shift_[reg]>>pos[length][2])&0x04) + ((shift_[reg]>>pos[length][3])&0x08) + ((shift_[reg]>>pos[length][4])&0x10) + ((shift_[reg]>>pos[length][5])&0x20) + ((shift_[reg]>>pos[length][6])&0x40) + ((shift_[reg]>>pos[length][7])&0x80))<<4;
      //       {0, 0, 1, 3, 6, 10, 15, 21} // for 32 bits = length=31 - check sense of this
    }
    break;
  case 4: // only output standard DAC on param->strobe/clock! so just maintain lastout
    if (param) {
      x=((shift_[reg] & masky[length-3])>>(rightshift[length-3]))<<leftshift[length-3]; // we want 12 bits but is not really audible difference
      lastout=x;
    }
    else x=lastout;
    break;
    /*  case 5: // hold last DAC on strobe/clk is inverse of 5
    if (param) {
      x=lastout;
    }
    else {
      x=((shift_[reg] & masky[length-3])>>(rightshift[length-3]))<<leftshift[length-3]; // we want 12 bits but is not really audible difference
      lastout=x;
    }      
    break;*/    
  case 6: // toggle to hold/release DAC
    if (param) toggle^=1;
    if (toggle) {
      x=lastout;
    }
    else {
      x=((shift_[reg] & masky[length-3])>>(rightshift[length-3]))<<leftshift[length-3]; // we want 12 bits but is not really audible difference
      lastout=x;
    }      
    break;
    // but we need to space these back TEST AGAIN
  case 7: // 4 spaced bits out! equiv bits or not - in this case not
    x= ( ( (shift_[reg]& (1<<lastspac[length][0]))>>lastspacbac[length][0]) + ((shift_[reg]& (1<<lastspac[length][1]))>>lastspacbac[length][1]) + ((shift_[reg]& (1<<lastspac[length][2]))>>lastspacbac[length][2]) + ((shift_[reg]& (1<<lastspac[length][3]))>>lastspacbac[length][3]) )<<8; // 4 bits to 12 bits
    break;

  case 8: // 4 spaced bits out! equiv bits
    x= ( ((shift_[reg]& (1<<lastspac[length][0]))>>lastspacbac[length][0]) + ((shift_[reg]& (1<<lastspac[length][1]))>>lastspacbac[length][1]) + ((shift_[reg]& (1<<lastspac[length][2]))>>lastspacbac[length][2]) + ((shift_[reg]& (1<<lastspac[length][3]))>>lastspacbac[length][3]) ); 
    x=countbts[x]*1023;
    break;

  case 9: // one SR is sieved out over another? as DAC option. XOR as sieve?
    // which one...
    x=((shift_[reg] & masky[length-3])>>(rightshift[length-3]))<<leftshift[length-3]; // we want 12 bits but is not really audible difference    
    x=x^(shift_[sieve[reg]] &masky[length-3]);
    break;
    ////
  } // switch    
  return x;
}



///////////////////////////////////////////////////////////////////////// 

#define delay()						 do {	\
    register unsigned int ix;					\
    for (ix = 0; ix < 1000; ++ix)				\
      __asm__ __volatile__ ("nop\n\t":::"memory");		\
  } while (0)

#define delayy()						 do {	\
    register unsigned int ix;					\
    for (ix = 0; ix < 10000000; ++ix)				\
      __asm__ __volatile__ ("nop\n\t":::"memory");		\
  } while (0)

