microresearch/allcolours/SR_segments/software/stm32f4xx_it_theone.c
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
    //    bitn=bitn^bitrr; // just XOR now for this mode

    //4-what is incoming pulsin bit if any? - incoming pulse will always be XORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
    PULSEOUT;
    }// counterw
  break; 

  ///////////////////////////////////////////////////////////////////////// 
  case 1: // cycle round only
  if (counter[w]>speed[w]){
    dactype[2]=0; // basic DAC out, others are fixed as basic
    counter[w]=0; 

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    //    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    //    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
    //    bitn=bitn^bitrr; // just XOR now for this mode
    bitn=(shift_[w]>>SRlength[w])& 0x01; //cycling bit
    
    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
    PULSEOUT;
  }// counterw
  break; 

  case 2: // cycle and pass only
  if (counter[w]>speed[w]){
    dactype[2]=0; 
    counter[w]=0; 

    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
      
    shift_[w]=shift_[w]<<1;
  
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
    bitn^=(shift_[w]>>SRlength[w])& 0x01; 

    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    dac[w]=DAC_(w, SRlength[w], dactype[w],0);
    PULSEOUT;
  }// counterw
  break;

  case 3: 
    // N: ADC/IN, route from/bits in/logic - pass on/XOR - LFSR 
    // L: route from/bits in/logic - pass on/OR
    // C: DAC/OUT, route from/bits in/logic - pass on/XOR - DACequiv
    // R: route from/bits in/logic  - pass on/OR
    
  if (counter[w]>speed[w]){
    counter[w]=0; 
    // here we can set options
    dactype[2]=1; // equiv DAC out, others are fixed as basic
    //    logtable[4]={0,1,0,1}; we set L and R to 1 which is OR
    logtable[0]=0; logtable[1]=1; logtable[2]=0; logtable[3]=1;
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    // BUT for LFSR in we have another route
    if (w==0){
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      bitn^=ADC_(w,SRlength[w],2,0); // XOR with LFSR
    }
    else
      {
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn=logop(bitn,xx,logtable[w]); // just for bits in
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 

    //7-pulses out if any
    PULSEOUT;
  }// counterw
  break; 

  case 4: // 
    // N: ADC/IN, route from/bits in/logic - pass on/XOR - ADC1bit 
    // L: route from/bits in/logic - pass on/AND
    // C: DAC/OUT, route from/bits in/logic - pass on/XOR - DAC1bit
    // R: route from/bits in/logic  - pass on/AND
    
  if (counter[w]>speed[w]){
    counter[w]=0; 
    // here we can set options
    dactype[2]=2; // 1 bit DAC out
    //    logtable[4]={0,1,0,1}; we set L and R to 1 which is OR
    logtable[0]=0; logtable[1]=2; logtable[2]=0; logtable[3]=2;
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    // BUT for LFSR in we have another route
    if (w==0){
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      bitn^=ADC_(w,SRlength[w],1,0); // XOR with 1 bit audio
    }
    else
      {
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn=logop(bitn,xx,logtable[w]); // just for bits in
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 

    //7-pulses out if any
    // L, C and R have 2 clocks out, N has none    
    tmp=(w<<1);
    if (bitn) *pulsoutLO[tmp]=pulsouts[tmp]; // N is just B with always zero
    else *pulsoutHI[tmp]=pulsouts[tmp];

