microresearch/allcolours/SR_segments/software/stm32f4xx_it_theone.c
    // follow AC scheme but we do maybe do a divide down of another bit-sofar is same! - make GENERIC    
    lengthbit=(SRlength[w]>>1); // /2
    new_stat=(shift_[w] & (1<<lengthbit))>>lengthbit; // so that is not just a simple divide down

    if (prev_stat[w]==0 && new_stat==1) flipd[w]^=1;
    prev_stat[w]=new_stat;	
    tmp++;
    if (flipd[w]) *pulsoutLO[tmp]=pulsouts[tmp];
    else *pulsoutHI[tmp]=pulsouts[tmp];        
  }// counterw
  break; 

    case 5: // 
    // N: ADC/IN, route from/bits in/logic - pass on/XOR - ADCxbit 
    // L: route from/bits in/logic - pass on/OR
    // C: DAC/OUT, route from/bits in/logic - pass on/XOR - DACspacers
    // R: route from/bits in/logic  - pass on/OR
    
  if (counter[w]>speed[w]){
    counter[w]=0; 
    // here we can set options
    dactype[2]=3; // spacerbit DAC out
    //    logtable[4]={0,1,0,1}; we set L and R to 1 which is OR
    logtable[0]=0; logtable[1]=3; logtable[2]=0; logtable[3]=3; // leaks
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    // BUT for LFSR in we have another route
    if (w==0){
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      bitn^=ADC_(w,SRlength[w],1,0); // XOR with 1 bit audio
    }
    else
      {
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn=logop(bitn,xx,logtable[w]); // just for bits in
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 

    //7-pulses out if any
PULSEOUT;  }// counterw
  break; 

  case 6: // 

    // N: ADC/IN, route from/bits in/logic - cycleXORpass on/XOR - LFSR 
    // L: route from/bits in/logic - cycle/pass on/OR
    // C: DAC/OUT, route from/bits in/logic - cycle/pass on/XOR - DACequiv
    // R: route from/bits in/logic  - cycle/pass on/OR
    
  if (counter[w]>speed[w]){
    counter[w]=0; 
    // here we can set options
    dactype[2]=1; // equiv DAC out, others are fixed as basic
    // logop: 0-XOR, 1-OR, 2-&, 3leaks
    logtable[0]=0; logtable[1]=1; logtable[2]=0; logtable[3]=1;
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    // BUT for LFSR in we have another route
    if (w==0){
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      bitn^=ADC_(w,SRlength[w],2,0); // XOR with LFSR
      bitn^=(shift_[w]>>SRlength[w])& 0x01; //cycling bit XOR in     
    }
    else
      {
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
    bitn^=(shift_[w]>>SRlength[w])& 0x01; //cycling bit XOR in - could be logop but...
      }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn=logop(bitn,xx,logtable[w]); // just for bits in
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 

    //7-pulses out if any
PULSEOUT;  }// counterw
  break; 

  case 7: // 
    // N: ADC/IN, route from/bits in/logic - cyclepass on/XOR - ADC1bit 
    // L: route from/bits in/logic - cyclepass on/AND
    // C: DAC/OUT, route from/bits in/logic - cyclepass on/XOR - DAC1bit
    // R: route from/bits in/logic  - cyclepass on/AND
    
  if (counter[w]>speed[w]){
    counter[w]=0; 
    // here we can set options
    dactype[2]=2; // 1 bit DAC out
    //    logtable[4]={0,1,0,1}; we set L and R to 1 which is OR
    logtable[0]=0; logtable[1]=2; logtable[2]=0; logtable[3]=2;
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    // BUT for LFSR in we have another route
    if (w==0){
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      bitn^=ADC_(w,SRlength[w],1,0); // XOR with 1 bit audio
      bitn^=(shift_[w]>>SRlength[w])& 0x01; //cycling bit XOR in     
    }
    else
      {
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;
    bitn^=(shift_[w]>>SRlength[w])& 0x01; //cycling bit XOR in     
      }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn=logop(bitn,xx,logtable[w]); // just for bits in
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 

    //7-pulses out if any
PULSEOUT;  }// counterw
  break; 

    case 8: // 
    // N: ADC/IN, route from/bits in/logic - cyclepass on/XOR - ADCxbit 
    // L: route from/bits in/logic - cyclepass on/OR
    // C: DAC/OUT, route from/bits in/logic - cyclepass on/XOR - DACspacers
    // R: route from/bits in/logic  - cyclepass on/OR
    
