microresearch/allcolours/SR_segments/software/stm32f4xx_it_theone.c
  if (counter[w]>speed[w]){
    counter[w]=0; 
    // here we can set options
    dactype[2]=3; // spacerbit DAC out
    //    logtable[4]={0,1,0,1}; we set L and R to 1 which is OR
    logtable[0]=0; logtable[1]=3; logtable[2]=0; logtable[3]=3; // leaks
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    // BUT for LFSR in we have another route
    if (w==0){
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      bitn^=ADC_(w,SRlength[w],1,0); // XOR with 1 bit audio
      bitn^=(shift_[w]>>SRlength[w])& 0x01; //cycling bit XOR in     
    }
    else
      {
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;
    bitn^=(shift_[w]>>SRlength[w])& 0x01; //cycling bit XOR in     
      }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn=logop(bitn,xx,logtable[w]); // just for bits in
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 

    //7-pulses out if any
PULSEOUT;  }// counterw
  break; 
  
  case 9: // just for trials with other ADC/DAC options... 
    // N: ADC/IN, route from/bits in/logic - pass on/XOR - experiment with ADCs
    // L: route from/bits in/logic - pass on/OR
    // C: DAC/OUT, route from/bits in/logic - pass on/XOR - DACequiv
    // R: route from/bits in/logic  - pass on/OR

  if (counter[w]>speed[w]){
    counter[w]=0; 
    // here we can set options
    dactype[2]=7; 
    //    logtable[4]={0,1,0,1}; we set L and R to 1 which is OR - just for bits in
    logtable[0]=0; logtable[1]=0; logtable[2]=0; logtable[3]=0;
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    // BUT for LFSR in we have another route
    if (w==0){// w below can be zeroed...
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;
      //      bitn=0;
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      //      bitn^=ADC_(w,SRlength[w],3,0); // XOR with: EQUIV BITS-TESTED!
      //      tmp=SRlength[w]>>1;
      //      bitn^=ADC_(0,SRlength[w],6,0); // param[0]
      //      bitn^=ADC_(0,SRlength[w],7,0); // comparator with param[0]
      //      bitn^=ADC_(0,SRlength[w],8,0); // strobe
      //      bitn^=ADC_(w,param[0],4,param[0]>>4);
      //      bitn^=ADC_(0,SRlength[w],10,trigger[0]); // strobe ADC in
      //      bitn^=ADC_(0,SRlength[w],12,3); // one bit DAC in //param is reg to get DAC from
      // int ADC_(uint32_t reg, uint32_t length, uint32_t type, uint32_t otherpar){ // here we use length as number of bits max is 12 bits
      // new adc strobe modes: 12,13,14,15,16
      bitn^=ADC_(0,SRlength[w],0,trigger[0]); // spaced bits in - 11 does not return bits though
    }
    else
      {
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn=logop(bitn,xx,logtable[w]); // just for bits in
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],trigger[w]); // question is then if we want to use param other than trigger?

    //7-pulses out if any
    PULSEOUT;  }// counterw
  break; 

  /////////////////////////////////////////////////////////////////////
  
  case 10: // probability modes to explore here:
    //    1. if SR<CV  // int mode --- SR is customSR or RSR(routed SR)
    //    1. invert cycling bit or not, pulsbit is ORed in (TM)

    if (trigger[w]==1){ // we don't use intflag!
      dactype[2]=0; // basic DAC out

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
      //2.5-shifting of which bits <<
      shift_[w]=shift_[w]<<1;
      bitn=(shift_[w]>>SRlength[w])& 0x01; //cycling bit
      if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 
      
      if ((LFSR_[w] & 4095 )<adc_buffer[lookupadc[w]]) { // 12 bits - which way round is this?
	// invert cycling bit only, no entry in, 
	bitn=bitn^1;
      }
      bitn|=xx;
      shift_[w]+=bitn;

    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
PULSEOUT;
    }
    break; 

  case 11: // probability modes to explore here:
    //    1. if SR<CV  // int mode --- SR is customSR or RSR(routed SR)
    //    1. invert routed-in-bit or not, pulsbit is ORed in (TM)

    if (trigger[w]==1){ // we don't use intflag!
      dactype[2]=0; // basic DAC out

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
      //2.5-shifting of which bits <<
      shift_[w]=shift_[w]<<1;
      
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      
      if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 
      
      if ((LFSR_[w] & 4095 )<adc_buffer[lookupadc[w]]) { // 12 bits - which way round is this?
	// invert cycling bit only, no entry in, 
	bitn=bitn^1;
      }
      bitn|=xx;
      shift_[w]+=bitn;

    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

