microresearch/allcolours/SR_segments/software/stm32f4xx_it_theone.c
    //7-pulses out if any
PULSEOUT;
    }
    break; 

  case 12: // probability modes to explore here:
    //    1. if SR<CV  // int mode --- SR is customSR or RSR(routed SR)
    //    1. invert cycle+routed-in-bit or not, pulsbit is ORed in (TM)

    if (trigger[w]==1){ // we don't use intflag!
      dactype[2]=0; // basic DAC out

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
      //2.5-shifting of which bits <<
      shift_[w]=shift_[w]<<1;
      
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      bitn^=(shift_[w]>>SRlength[w])& 0x01; //cycling bit XOR in     
      
      if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 
      
      if ((LFSR_[w] & 4095 )<adc_buffer[lookupadc[w]]) { // can also be DAC
	// invert cycling bit only, no entry in, 
	bitn=bitn^1;
      }
      bitn|=xx;
      shift_[w]+=bitn;

    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
    PULSEOUT;
    }
    break; 

  case 13: // probability modes to explore here:
    //    1. if SR<CV  // int mode --- SR is customSR or RSR(routed SR)
    //3. new input (from pulsbit) or cycling bit (wiard and EN)  - if we don't have pulsebit then route
    
    if (trigger[w]==1){ // we don't use intflag!
      dactype[2]=0; // basic DAC out

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
      //2.5-shifting of which bits <<
      shift_[w]=shift_[w]<<1;
            
      
      if ((LFSR_[w] & 4095 )<adc_buffer[lookupadc[w]]) { // 12 bits - which way round is this?
      bitn=(shift_[w]>>SRlength[w])& 0x01; //cycling bit XOR in     
      }
      else
	{
	  if (pulsins[w]!=0) bitn=!(GPIOC->IDR & pulsins[w]); 
	  else { // if we don't use pulseins
	    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
	    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
	  }	  	  
	}      
      shift_[w]+=bitn;

    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
PULSEOUT;
    }
    break; 

  case 14: // probability modes to explore here:
    //    1. if SR<CV  // int mode --- SR is customSR or RSR(routed SR)
    //4. new input (from route) or cycling bit - and OR in pulsebit if...    
    if (trigger[w]==1){ // we don't use intflag!
      dactype[2]=0; // basic DAC out

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
      //2.5-shifting of which bits <<
      shift_[w]=shift_[w]<<1;
            
      
      if ((LFSR_[w] & 4095 )<adc_buffer[lookupadc[w]]) { // 12 bits - which way round is this?
      bitn=(shift_[w]>>SRlength[w])& 0x01; //cycling bit XOR in     
      }
      else{
	bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
	Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
	}
    if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 

      shift_[w]+=bitn|xx;

    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
PULSEOUT;
    }
    break; 

  case 15: // probability modes to explore here:
    //    1. if SR<CV  // int mode --- SR is customSR or RSR(routed SR)
    //4. new input (from route/ADC) or cycling bit - and OR in pulsebit if...
    /// or in case of w==0 NSR we have ADC/LFSR in depending on type - but THIS is not extra to mode 14 as it will simply repeat those except for NSR
    // but now we change thi so is inverted routing bit
    if (trigger[w]==1){ // we don't use intflag!
      dactype[2]=0; // basic DAC out

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
      //2.5-shifting of which bits <<
      shift_[w]=shift_[w]<<1;
            
      
      if ((LFSR_[w] & 4095 )<adc_buffer[lookupadc[w]]) { // 12 bits - which way round is this?
      bitn=(shift_[w]>>SRlength[w])& 0x01; //cycling bit XOR in     
      }
      else{
	if (w==0){
	  bitn=ADC_(w,SRlength[w],0,0); // 0 is bits in, 2 is LFSR
	}
	else
	  {
	bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
	Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;
	bitn^=1;
	  }
	}
    if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 

      shift_[w]+=bitn|xx;

    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
PULSEOUT;
    }
    break; 

  case 16: // probability modes to explore here:
    //1. if SR<CV  // int mode --- SR is customSR or RSR(routed SR)
    //6. new input (from ADCtypeX) or route in     
    // how these match/repeat above when we don't have ADC ??? - maybe do inverted route bit in for others // with cycling bit
    
    if (trigger[w]==1){ // we don't use intflag!
      dactype[2]=0; // basic DAC out

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
      //2.5-shifting of which bits <<
      shift_[w]=shift_[w]<<1;
            
      
      if ((LFSR_[w] & 4095 )<adc_buffer[lookupadc[w]]) { // 12 bits - which way round is this?
	bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
	Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;
      }
      else{
	if (w==0){
	  bitn=ADC_(w,SRlength[w],0,0); // 0 is bits in, 2 is LFSR
	}
	else
	  {
	    bitn=(!(shift_[w]>>SRlength[w])) & 0x01; //
 	  }
	}
    if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 

      shift_[w]+=bitn|xx;

    //6-DAC result for any purposes - do we output in main loop?
   dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

