microresearch/allcolours/SR_segments/software/stm32f4xx_it_theone.c
    //7-pulses out if any
PULSEOUT;
    }
    break; 

    //3. if SR<DAC+CV // int mode from 10-16 repeat with sr<adc+dac[2]
    
  case 17: // probability modes to explore here:
    //    1. if SR<CV  // int mode --- SR is customSR or RSR(routed SR)
    //    1. invert cycling bit or not, pulsbit is ORed in (TM)

    if (trigger[w]==1){ // we don't use intflag!
      dactype[2]=0; // basic DAC out

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
      //2.5-shifting of which bits <<
      shift_[w]=shift_[w]<<1;
      bitn=(shift_[w]>>SRlength[w])& 0x01; //cycling bit
      if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 
      //      tmpt=((dacr>>2)-(1024-speedc)); // dacr is 12 bits, speedc is 10 bits
      tmpt=dac[dacroute[w]]-(4095-adc_buffer[lookupadc[w]]);
      if (tmpt<0) tmpt=0; // or just add them      
      if ((LFSR_[w] & 4095 )<tmpt) { // 12 bits - which way round is this? - we fix now on dac[2]
	// invert cycling bit only, no entry in, 
	bitn=bitn^1;
      }
      bitn|=xx;
      shift_[w]+=bitn;

    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 
    PULSEOUT;
    }
    break; 

  case 18:
    //    LFSR<DAC
    // first for CV modes and prob - copy of 17 which is copy of 10
    //    1. if SR<CV  // int mode --- SR is customSR or RSR(routed SR)
    //    1. invert cycling bit or not, pulsbit is ORed in (TM)

  if (counter[w]>speed[w]){
    counter[w]=0; 

    dactype[2]=0; // basic DAC out

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
      //2.5-shifting of which bits <<
      shift_[w]=shift_[w]<<1;
      bitn=(shift_[w]>>SRlength[w])& 0x01; //cycling bit
      if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 
      if ((LFSR_[w] & 4095 )<dac[dacroute[w]]) { // 12 bits - which way round is this? - we fix now on dac[2]
	// invert cycling bit only, no entry in, 
	bitn=bitn^1;
      }
      bitn|=xx;
      shift_[w]+=bitn;

    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 
    PULSEOUT;
    }
    break; 

  case 19:
    // first for CV modes and prob - copy of 17 which is copy of 10
    //    1. if SR<CV  // int mode --- SR is customSR or RSR(routed SR)
    //    1. invert cycling bit or not, pulsbit is ORed in (TM)

  if (counter[w]>speed[w]){
    counter[w]=0; 

    dactype[2]=0; // basic DAC out

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
      //2.5-shifting of which bits <<
      shift_[w]=shift_[w]<<1;
      bitn=(shift_[w]>>SRlength[w])& 0x01; //cycling bit
      if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 
      if ((LFSR_[w] & 4095 )<param[w]) { // 12 bits - which way round is this? - we fix now on dac[2]
	// invert cycling bit only, no entry in, 
	bitn=bitn^1;
      }
      bitn|=xx;
      shift_[w]+=bitn;

    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
PULSEOUT;
    }
    break; 
    
    // fill in 10-17

  case 20: //as case 3 but for INT modes and with test ADC 11 mode in! CV as comparator
    // N: ADC/IN, route from/bits in/logic - pass on/XOR - LFSR 
    // L: route from/bits in/logic - pass on/OR
    // C: DAC/OUT, route from/bits in/logic - pass on/XOR - DACequiv
    // R: route from/bits in/logic  - pass on/OR

    
    //  if (counter[w]>speed[w]){
    //    counter[w]=0; 
    // here we can set options
    if (trigger[w]==1){ // we don't use intflag!
	  
    dactype[2]=0; // equiv DAC out, others are fixed as basic
    //    logtable[4]={0,1,0,1}; we set L and R to 1 which is OR
    logtable[0]=0; logtable[1]=1; logtable[2]=0; logtable[3]=1;
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    // BUT for LFSR in we have another route
    if (w==0){
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      bitn^=ADC_(w,SRlength[w],11,0); // XOR with LFSR
    }
    else
      {
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn=logop(bitn,xx,logtable[w]); // just for bits in
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 

    //7-pulses out if any
PULSEOUT;  }// counterw
  break; 

  case 21: // triadex inspired mode where we XOR in bits from the other SRs
    // but which bits and do we use static SR or shift ghostSRs round...
    // try ghosted SRs...
    if (counter[w]>speed[w]){
    dactype[2]=0; // basic DAC out, others are fixed as basic

    counter[w]=0; 
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    bitn = (Gshift_[others[w][0]][w]>>SRlength[others[w][0]]) & 0x01; 
    Gshift_[others[w][0]][w]=(Gshift_[others[w][0]][w]<<1)+bitn;

    bitnn = (Gshift_[others[w][1]][w]>>SRlength[others[w][1]]) & 0x01; 
    Gshift_[others[w][1]][w]=(Gshift_[others[w][1]][w]<<1)+bitnn;

