microresearch/allcolours/SR_segments/software/stm32f4xx_it_theone.c
    bitnnn = (Gshift_[others[w][2]][w]>>SRlength[others[w][2]]) & 0x01; 
    Gshift_[others[w][2]][w]=(Gshift_[others[w][2]][w]<<1)+bitnnn;

    bitn^=((shift_[w]>>SRlength[w])& 0x01)^bitnn^bitnnn; 

    //4-what is incoming pulsin bit if any? - incoming pulse will always be XORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
PULSEOUT;  }// counterw
  break; 

  case 22: // triadex inspired mode where we XOR in bits from the other SRs
    // but which bits and do we use static SR or shift ghostSRs round...
    // this one with static SR!
    if (counter[w]>speed[w]){
    dactype[2]=0; 

    counter[w]=0; 
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
      
    shift_[w]=shift_[w]<<1;
  
    bitn = (shift_[others[w][0]]>>SRlength[others[w][0]]) & 0x01; 
    bitnn = (shift_[others[w][1]]>>SRlength[others[w][1]]) & 0x01; 
    bitnnn = (shift_[others[w][2]]>>SRlength[others[w][2]]) & 0x01; 
    bitn^=((shift_[w]>>SRlength[w])& 0x01)^bitnn^bitnnn; 

    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 
    PULSEOUT;
    }// counterw
  break; 

  case 23: // pass on but trigger bumps on default route
    // can also be multiple routes in/change to binary routing table
    
    if (counter[w]>speed[w]){
    dactype[2]=0; // basic DAC out, others are fixed as basic

    if (trigger[w]){
      ourroute[w]++;
      if (ourroute[w]>3) ourroute[w]=0;
    }
    
    counter[w]=0; 
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    bitn = (Gshift_[ourroute[w]][w]>>SRlength[ourroute[w]]) & 0x01; 
    Gshift_[ourroute[w]][w]=(Gshift_[ourroute[w]][w]<<1)+bitn;  
    //    bitn=bitn^bitrr; // just XOR now for this mode

    //4-what is incoming pulsin bit if any? - incoming pulse will always be XORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
PULSEOUT;  }// counterw
  break; 

  case 24: // can also be multiple routes in/change to binary routing table
    // first implementation of multiple routing table
        if (counter[w]>speed[w]){
    dactype[2]=0; // basic DAC out, others are fixed as basic

    if (trigger[w]){ // bump up binary routing table which is route[]
      route[w]++;
      if (route[w]>15) route[w]=0; // 15 is all routes, 8,4,2,1
    }
    
    counter[w]=0; 
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;

    // work with the binary routing table
    bitn=0;
    tmp=route[w]; // route can also be another SR!
    // if route to ourself then is cycling bit but we still need to cycle <<1 above!
    for (x=0;x<4;x++){ //unroll?
      if (tmp&0x01){  
	bitrr = (Gshift_[x][w]>>SRlength[x]) & 0x01; // or other logical opp for multiple bits/accum
	Gshift_[x][w]=(Gshift_[x][w]<<1)+bitrr;  // we had x and w wrong way round - x is ghost SR number, w is our own copy for this SR
	bitn^=bitrr;//logop(bitn,bitrr,logopp[w]); // but what if we want different logical opps for each?
    }
    tmp=tmp>>1;
    }
    
    //4-what is incoming pulsin bit if any? - incoming pulse will always be XORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); // TODO - add in DACtype.. basic DAC-0

    //7-pulses out if any
PULSEOUT;  }// counterw
  break; 

  case 25: // can also be multiple routes in/change to binary routing table
    // implementation of multiple routing table
    // this is an INT mode with CV as the routing table
    // table is 4 bits but we can have DAC selection on extra 2 bits for all SRs
    // how this works with ADC in or we don't route that one - default route in...
    // and use bits to select types there... TRY THIS

    if (trigger[w]==1){ // we don't use intflag!

      tmpp=adc_buffer[lookupadc[w]]>>6; // this can also be RSR DAC! 12 bits down to 6 bits
      
      //      dactype[2]=(tmpp>>10)&3; // upper 2 bits but we do this below

      Gshift_[w][0]=shift_[w]; 
      Gshift_[w][1]=shift_[w]; 
      Gshift_[w][2]=shift_[w];
      Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;

    // work with the binary routing table - but 0 is a route from nowhere...
    bitn=0;
    tmp=tmpp&15; // bottom 4 bits 
    for (x=0;x<4;x++){ //unroll?
      if (tmp&0x01){  
	bitrr = (Gshift_[x][w]>>SRlength[x]) & 0x01; // or other logical opp for multiple bits/accum
	Gshift_[x][w]=(Gshift_[x][w]<<1)+bitrr;  // we had x and w wrong way round - x is ghost SR number, w is our own copy for this SR
	bitn^=bitrr;//logop(bitn,bitrr,logopp[w]); // but what if we want different logical opps for each?
    }
    tmp=tmp>>1;
    }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be XORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], (tmpp>>4)&3,0); // all DACTypes changed here - top bits

