microresearch/allcolours/SR_segments/software/stm32f4xx_it_theone.c
    }
  break;
  
  /////////////////////////////////////////////////////////////////////////
  /// new modes testings from 2/11/2021+
  /////////////////////////////////////////////////////////////////////////

  case 29: // copy of 19 trial for ADC in probablity modes - adc_buffer[12] 12 bits
  if (counter[w]>speed[w]){
    counter[w]=0; 

    dactype[2]=0; 
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
      
    shift_[w]=shift_[w]<<1;
    bitn=(shift_[w]>>SRlength[w])& 0x01;
    if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 
    if ((LFSR_[w] & 4095 )<adc_buffer[12]) {
      bitn=bitn^1;
    }
    bitn|=xx;
    shift_[w]+=bitn;
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 
    PULSEOUT;
  }
  break; 

  case 30:    //    ownDAC<DAC
  if (counter[w]>speed[w]){
    counter[w]=0; 
    dactype[2]=0; 

    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
      
    shift_[w]=shift_[w]<<1;
    bitn=(shift_[w]>>SRlength[w])& 0x01; //cycling bit
    if (pulsins[w]!=0) xx=!(GPIOC->IDR & pulsins[w]); 
    if ((dac[w] )<dac[dacroute[w]]) { 
      bitn=bitn^1;
    }
    bitn|=xx;
    shift_[w]+=bitn;

    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 
    PULSEOUT;
    }
    break; 

 case 31: // speedfrom/CV.DAC template to test - 4 options here to test...
      if (counter[w]>(speed[w]+dac[speedfrom_[w]])){// add means we always slow down - other options (wrap, lookup) //1//
  
    //2//    tmpt=(dac[speedfrom_[w]]>>2)-(1024-speed[w]);
   //    if (tmpt<0) tmpt=0; 

   //3//tmpt= speed[w]-(dac[speedfrom_[w]]>>2);
   //   if (tmpt<0) tmpt=0; 

   //4//   if (counter[w]>((dac[speedfrom_[w]]>>2)%speed[w])){ // wrap

     //2/3  if (counter[w]>tmpt){
  
     dactype[2]=0; 

    counter[w]=0; 
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w];       
    shift_[w]=shift_[w]<<1;
  
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  

    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    
    dac[w]=DAC_(w, SRlength[w], dactype[w],0);
    PULSEOUT;
    }// counterw
  break; 

  case 33: // strobe case withOUT looping option
    //accumulate into GGGshift and then bang in to realSR on a CLKIN (how many accumulated bits or just whole SR length?)
    if (counter[w]>speed[w]){
    dactype[2]=0; 

    counter[w]=0; 
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
      
    GGGshift_[w]=GGGshift_[w]<<1;
    
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  

    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    GGGshift_[w]+=bitn;
   
    if (trigger[w]==1) { // strobe
      shift_[w]&=invmasky[SRlength[w]]; 
      shift_[w]+=(GGGshift_[w]&masky[SRlength[w]]);
    }

    dac[w]=DAC_(w, SRlength[w], dactype[w],0);
    PULSEOUT;
    }// counterw
  break; 

  
  case 34: // strobe case with looping option
    //accumulate into GGGshift and then bang in to realSR on a CLKIN (how many accumulated bits or just whole SR length?)
    if (counter[w]>speed[w]){
    dactype[2]=0; 

    counter[w]=0; 
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
      
    GGGshift_[w]=GGGshift_[w]<<1;

    shift_[w]=shift_[w]<<1;
    tmp=(shift_[w]>>SRlength[w])& 0x01;
    shift_[w]+=tmp;
    
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  

    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    GGGshift_[w]+=bitn;
   
    if (trigger[w]==1) { // strobe
      shift_[w]&=invmasky[SRlength[w]]; 
      shift_[w]+=(GGGshift_[w]&masky[SRlength[w]]);
    }

    dac[w]=DAC_(w, SRlength[w], dactype[w],0);
    PULSEOUT;
    }// counterw
  break; 

  case 35: // TRIADEX 2
    //    - triadex: we could use counters from clkins as indicator of which bits from which SR to parity-in
    // so table would be for 4 bits from 4x maxSRlength=32*4=128 (ignore lengths)
    //    bt = ((shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][0])) ^ (shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][1])) ^ (shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][2])) ^ (shift_[LFSR[reg]] >> (lfsr_taps[SRlength[LFSR[reg]]][3]))) & 1u;
    // 4 bits are each other SR counters: length 128 of counter...

    if (counter[w]>speed[w]){
    dactype[2]=0; 

    counter[w]=0; 
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
      
    shift_[w]=shift_[w]<<1;

    s[0]=intcnt[0]>>5; // select which one... 0,1,2,3
    ss[0]=intcnt[0]%32; // 32 bits
    s[1]=intcnt[1]>>5; // select which one... 0,1,2,3
    ss[1]=intcnt[1]%32; // 32 bits
    s[2]=intcnt[2]>>5; // select which one... 0,1,2,3
    ss[2]=intcnt[2]%32; // 32 bits
    s[3]=intcnt[3]>>5; // select which one... 0,1,2,3
    ss[3]=intcnt[3]%32; // 32 bits

    
    bitn = (shift_[s[0]] >> ss[0]) & 0x01;
    bitnn = (shift_[s[1]] >> ss[1]) & 0x01;
    bitnnn = (shift_[s[2]] >> ss[2]) & 0x01; 	
    bitnnnn = (shift_[s[3]] >> ss[3]) & 0x01; 
    
    bitn^=((shift_[w]>>SRlength[w])& 0x01)^bitnn^bitnnn^bitnnnn; 

    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 
    PULSEOUT;
    }// counterw
  break; 

  case 36: // pulse triggers exchange between ghost and real
    if (counter[w]>speed[w]){
    dactype[2]=0; 
    counter[w]=0; 

    if (trigger[w]==1) { // at start we place it...
      shift_[w]=Gshift_[w][w];
    }
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
      
    shift_[w]=shift_[w]<<1;
  
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  

    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;

    dac[w]=DAC_(w, SRlength[w], dactype[w],0);
    PULSEOUT;
    }// counterw
  break; 

  case 37: // pulse triggers un/holding of the ghost
    if (counter[w]>speed[w]){
    dactype[2]=0; 
    counter[w]=0; 

    if (trigger[w]==1) {
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
    }
    
    shift_[w]=shift_[w]<<1;
  
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  

    bitnn = (Gshift_[w][w]>>SRlength[w]) & 0x01; 
    Gshift_[w][w]=(Gshift_[w][w]<<1)+bitnn;  
        
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn^bitnn;

    dac[w]=DAC_(w, SRlength[w], dactype[w],0);
    PULSEOUT;
    }// counterw
  break; 

  case 38: // pass through or cycle is toggled by clkin bit 
  if (counter[w]>speed[w]){
    dactype[2]=9; // test the sieve 
    counter[w]=0; 

    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
      
    shift_[w]=shift_[w]<<1;

    if (trigger[w]) tug[w]^=1; // tuggle
    
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  // route in
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;
    if (tug[w]) bitn=(shift_[w]>>SRlength[w])& 0x01;  // cycle...
    
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    dac[w]=DAC_(w, SRlength[w], dactype[w],0);
    PULSEOUT;
  }// counterw
  break;

  case 39:
    // additive DACs into DAC2 - excepyt 2 itself? is this done here though?
    // = multiple DACs - but how we do this as a single mode (add/sub/wrap other DACS, additive DAC into DAC[2])
    // how could this work as a mode... we do dac[w] here so we don't want to add all...
    // and what if all modes are set to this... mode[w] i am dac out and add all...
    if (w==0) dac[2]==0;

