microresearch/allcolours/SR_segments/software/stm32f4xx_it_theone.c
    if (counter[w]>speed[w]){
    dactype[2]=0; 

    counter[w]=0; 
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; 
      
    shift_[w]=shift_[w]<<1;
  
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  

    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn^=xx;
    }
    
    shift_[w]+=bitn;
    
    dac[2]+=DAC_(w, SRlength[w], dactype[w],0); // additive DAC
    dac[2]=dac[2]&4095;
    PULSEOUT;
    }// counterw    
    break;





    /////////////////////////////////////////////////////////////////////////
    /// extra experimental cases // tested
    /////////////////////////////////////////////////////////////////////////
  case 104:  // let's try INT driven one for pulse train mode
  // INT triggers train of CV pulses at speed DAC - and can also be vice versa
    // INT can also start new train or let old one carry on (now it starts new train...)
    if (trigger[w]==1){ 
      train[w]=1; // we can use train as counter      
    }
    if (train[w]!=0 && train[w]<(speed[w]+1)){ // number of pulses
      // do train so first we need speed counter
      if (counter[w]>dac[dacroute[w]]){ // or another dac
	train[w]++;
	// from DACR now but can be dacfrom!
	counter[w]=0;
	// now we can do any kind of SR, but guess makes sense for NSR to be LFSR or so???
	// so we borrow some from mode 3
	dactype[2]=0; // basic DAC out
	//    logtable[4]={0,1,0,1}; we set L and R to 1 which is OR
	//    logtable[0]=0; logtable[1]=1; logtable[2]=0; logtable[3]=1;
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    // BUT for LFSR in we have another route
    if (w==0){
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      bitn^=ADC_(w,SRlength[w],2,0); // XOR with LFSR
    }
    else
      {
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn=bitn^xx;
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 

    //7-pulses out if any
    PULSEOUT;    
      }
    }
    else train[w]=0; // train ran out
    
    break;
    ///////////
  case 105:// this is the vice versa of the above
    // let's try INT driven one for pulse train mode
  // INT triggers train of CV pulses at speed DAC - and can also be vice versa
    // INT can also start new train or let old one carry on (now it starts new train...)
    if (trigger[w]==1){ 
      train[w]=1; // we can use train as counter      
    }
    if (train[w]!=0 && train[w]<dac[3]){ // number of pulses
      // do train so first we need speed counter
      if (counter[w]>speed[w]){ // or another dac
	train[w]++;
	// from DACR now but can be dacfrom!
	counter[w]=0;
	// now we can do any kind of SR, but guess makes sense for NSR to be LFSR or so???
	// so we borrow some from mode 3
	dactype[2]=0; // basic DAC out
	//    logtable[4]={0,1,0,1}; we set L and R to 1 which is OR
	//    logtable[0]=0; logtable[1]=1; logtable[2]=0; logtable[3]=1;
    
    Gshift_[w][0]=shift_[w]; 
    Gshift_[w][1]=shift_[w]; 
    Gshift_[w][2]=shift_[w];
    Gshift_[w][3]=shift_[w]; // ghosts for l,c,r only but let's keep one spare
      
    //2.5-shifting of which bits <<
    shift_[w]=shift_[w]<<1;
  
    //3-what is routing for incoming SR bits, cycling bit
    // we have default route here
    // BUT for LFSR in we have another route
    if (w==0){
      bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01;  
      Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      bitn^=ADC_(w,SRlength[w],2,0); // XOR with lFSR
    }
    else
      {
    bitn = (Gshift_[defroute[w]][w]>>SRlength[defroute[w]]) & 0x01; 
    Gshift_[defroute[w]][w]=(Gshift_[defroute[w]][w]<<1)+bitn;  
      }

    //4-what is incoming pulsin bit if any? - incoming pulse will always be ORed in
    if (pulsins[w]!=0){
    xx=!(GPIOC->IDR & pulsins[w]); 
    bitn=bitn^xx;
    }
    
    shift_[w]+=bitn;
    
    //6-DAC result for any purposes - do we output in main loop?
    dac[w]=DAC_(w, SRlength[w], dactype[w],0); 

    //7-pulses out if any
    PULSEOUT;    
      }
    }
    else train[w]=0; // train ran out
    
    break;


    /////////////////////////////////////////////////////////////////////////     /////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////// 
    // what other simple modes can be: to list:

    //2-pass and cycle with other logics in L and R, other options PLUS-ADC in options, LFSR for NSR, different DACs out for CSR
  // so L and R have other logics and we go thru DAC and ADC options with simple pass through say
  // see how many modes we can manage then...
  
    // ????eg. cycle with adc, cycle with lfsr, pass with adc, pass with lfsr, pass and cycle with adc, pass and cycle with lfsr    (only for top)

    ///////////////////////////////////////////////////////////////////////// 
  } // switch
  //    } //4x

      // DAC output 
      // for the moment we just output from dac[2] ->[0,1,2C,3]=2 is C
  //  set whichever DAC if there is a special, over-riding mode
      DAC_SetChannel1Data(DAC_Align_12b_R, dac[2]); // 1000/4096 * 3V3 == 0V8 
      int j = DAC_GetDataOutputValue (DAC_Channel_1); // DACout is inverting  

      // and fake CLKs TODO - top NSR is from R/3
      // DAC for normed NSR/PWM 
      tmp= dac[3]; // right hand
      tmp+=320; 
      TIM1->ARR =tmp; // what range this should be? - connect to SRlengthc
      TIM1->CCR1 = tmp/2; // pulse width

      //TODO
      // fake CLKINs for L,R,C are from Cspeed==2 - this needs to be in speeds then but...
      /*
      flipper^=1;
      if (flipper) GPIOB->BSRRH = clk_route[clkr];  // clear bits of fake_one - clkr is 7 so all of them
      // or we can set L and R from an independent SR with only CSR as clocked from here
      else   GPIOB->BSRRL=clk_route[clkr]; //  write bits       
      */

 }
